mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xl/common/mb9bf56xl.h
#define bFM_GPIO_DDR0_P0                          *((volatile  uint8_t *)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P0                         *((volatile  uint8_t *)(0x42DE4000UL))
#define bFM_GPIO_DDR0_P1                          *((volatile  uint8_t *)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P1                         *((volatile  uint8_t *)(0x42DE4004UL))
#define bFM_GPIO_DDR0_P2                          *((volatile  uint8_t *)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P2                         *((volatile  uint8_t *)(0x42DE4008UL))
#define bFM_GPIO_DDR0_P3                          *((volatile  uint8_t *)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P3                         *((volatile  uint8_t *)(0x42DE400CUL))
#define bFM_GPIO_DDR0_P4                          *((volatile  uint8_t *)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P4                         *((volatile  uint8_t *)(0x42DE4010UL))

#define bFM_GPIO_DDR1_P0                          *((volatile  uint8_t *)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P0                         *((volatile  uint8_t *)(0x42DE4080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile  uint8_t *)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P1                         *((volatile  uint8_t *)(0x42DE4084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile  uint8_t *)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P2                         *((volatile  uint8_t *)(0x42DE4088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile  uint8_t *)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P3                         *((volatile  uint8_t *)(0x42DE408CUL))

#define bFM_GPIO_DDR2_P0                          *((volatile  uint8_t *)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P0                         *((volatile  uint8_t *)(0x42DE4100UL))
#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P1                         *((volatile  uint8_t *)(0x42DE4104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P2                         *((volatile  uint8_t *)(0x42DE4108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P3                         *((volatile  uint8_t *)(0x42DE410CUL))
#define bFM_GPIO_DDR2_P4                          *((volatile  uint8_t *)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P4                         *((volatile  uint8_t *)(0x42DE4110UL))
#define bFM_GPIO_DDR2_P5                          *((volatile  uint8_t *)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P5                         *((volatile  uint8_t *)(0x42DE4114UL))
#define bFM_GPIO_DDR2_P6                          *((volatile  uint8_t *)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P6                         *((volatile  uint8_t *)(0x42DE4118UL))

#define bFM_GPIO_DDR3_P0                          *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P0                         *((volatile  uint8_t *)(0x42DE4180UL))
#define bFM_GPIO_DDR3_P1                          *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P1                         *((volatile  uint8_t *)(0x42DE4184UL))
#define bFM_GPIO_DDR3_P2                          *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P2                         *((volatile  uint8_t *)(0x42DE4188UL))
#define bFM_GPIO_DDR3_P3                          *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P3                         *((volatile  uint8_t *)(0x42DE418CUL))
#define bFM_GPIO_DDR3_P4                          *((volatile  uint8_t *)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P4                         *((volatile  uint8_t *)(0x42DE4190UL))
#define bFM_GPIO_DDR3_P5                          *((volatile  uint8_t *)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P5                         *((volatile  uint8_t *)(0x42DE4194UL))

#define bFM_GPIO_DDR4_P0                          *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P0                         *((volatile  uint8_t *)(0x42DE4200UL))
#define bFM_GPIO_DDR4_P1                          *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P1                         *((volatile  uint8_t *)(0x42DE4204UL))
#define bFM_GPIO_DDR4_P6                          *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P6                         *((volatile  uint8_t *)(0x42DE4218UL))
#define bFM_GPIO_DDR4_P7                          *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P7                         *((volatile  uint8_t *)(0x42DE421CUL))
#define bFM_GPIO_DDR4_P8                          *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P8                         *((volatile  uint8_t *)(0x42DE4220UL))
#define bFM_GPIO_DDR4_P9                          *((volatile  uint8_t *)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P9                         *((volatile  uint8_t *)(0x42DE4224UL))

#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P0                         *((volatile  uint8_t *)(0x42DE4280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P1                         *((volatile  uint8_t *)(0x42DE4284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P2                         *((volatile  uint8_t *)(0x42DE4288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P3                         *((volatile  uint8_t *)(0x42DE428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P4                         *((volatile  uint8_t *)(0x42DE4290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P5                         *((volatile  uint8_t *)(0x42DE4294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P6                         *((volatile  uint8_t *)(0x42DE4298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile  uint8_t *)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P7                         *((volatile  uint8_t *)(0x42DE429CUL))

