mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xl/common/mb9bf56xl.h
#define bFM_GPIO_PDOR4_P0                         *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P0                        *((volatile  uint8_t *)(0x42DE8200UL))
#define bFM_GPIO_PDOR4_P1                         *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P1                        *((volatile  uint8_t *)(0x42DE8204UL))
#define bFM_GPIO_PDOR4_P6                         *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P6                        *((volatile  uint8_t *)(0x42DE8218UL))
#define bFM_GPIO_PDOR4_P7                         *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P7                        *((volatile  uint8_t *)(0x42DE821CUL))
#define bFM_GPIO_PDOR4_P8                         *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P8                        *((volatile  uint8_t *)(0x42DE8220UL))
#define bFM_GPIO_PDOR4_P9                         *((volatile  uint8_t *)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P9                        *((volatile  uint8_t *)(0x42DE8224UL))

#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P0                        *((volatile  uint8_t *)(0x42DE8280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P1                        *((volatile  uint8_t *)(0x42DE8284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P2                        *((volatile  uint8_t *)(0x42DE8288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P3                        *((volatile  uint8_t *)(0x42DE828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P4                        *((volatile  uint8_t *)(0x42DE8290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P5                        *((volatile  uint8_t *)(0x42DE8294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P6                        *((volatile  uint8_t *)(0x42DE8298UL))
#define bFM_GPIO_PDOR5_P7                         *((volatile  uint8_t *)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P7                        *((volatile  uint8_t *)(0x42DE829CUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P0                        *((volatile  uint8_t *)(0x42DE8300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P1                        *((volatile  uint8_t *)(0x42DE8304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P2                        *((volatile  uint8_t *)(0x42DE8308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P3                        *((volatile  uint8_t *)(0x42DE830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P4                        *((volatile  uint8_t *)(0x42DE8310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P5                        *((volatile  uint8_t *)(0x42DE8314UL))
#define bFM_GPIO_PDOR6_P6                         *((volatile  uint8_t *)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P6                        *((volatile  uint8_t *)(0x42DE8318UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P0                        *((volatile  uint8_t *)(0x42DE8400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P1                        *((volatile  uint8_t *)(0x42DE8404UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P0                         *((volatile  uint8_t *)(0x42DE0000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P1                         *((volatile  uint8_t *)(0x42DE0004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P2                         *((volatile  uint8_t *)(0x42DE0008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P3                         *((volatile  uint8_t *)(0x42DE000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P4                         *((volatile  uint8_t *)(0x42DE0010UL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P0                         *((volatile  uint8_t *)(0x42DE0080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P1                         *((volatile  uint8_t *)(0x42DE0084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P2                         *((volatile  uint8_t *)(0x42DE0088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P3                         *((volatile  uint8_t *)(0x42DE008CUL))

